n5/src/DataProcessors/LoadOrganizations/LoadOrganizations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>LoadOrganizations</name>
  <attributes>
    <name>Path</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Invoices</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Customer</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>FormNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.InvoiceRecord</types>
      </type>
    </attributes>
    <attributes>
      <name>Load</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>LoadingPoint</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Memo</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Number</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>DefinedType.ReferenceSeries</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

n5/src/Enums/FormStatuses/FormStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FormStatuses</name>
  <enumValues>
    <name>Saved</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>Unloaded</name>
  </enumValues>
  <enumValues>
    <name>Printed</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Returned</name>
  </enumValues>
</mdclass:Enum>

n5/src/DataProcessors/LoadOrganizations/Forms/Form/Module.bsl
&AtClient
var TableRow;

// *****************************************
// *********** Form events

&AtClient
Procedure OnOpen ( Cancel )

	LocalFiles.Prepare ();

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure PathStartChoice ( Item, ChoiceData, StandardProcessing )
	
	StandardProcessing = false;
	dialog = new FileDialog ( FileDialogMode.Open );
	dialog.Directory = Directory;
	dialog.Multiselect = false;
	dialog.Filter = "XML (*.xml)|*.xml";
	dialog.Show ( new NotifyDescription ( "SelectFile", ThisObject ) );
	
EndProcedure

&AtClient
Procedure SelectFile ( Files, Params ) export
	
	if ( Files = undefined ) then
		return;
	endif; 
	Object.Path = Files [ 0 ];
	loadFile ();
	
EndProcedure 

&AtClient
Procedure loadFile ()
	
	path = Object.Path;
	if ( path = "" ) then
		return;
	endif;
	Directory = FileSystem.GetFolder ( path );
	callback = new NotifyDescription ( "StartLoadingFile", ThisObject );
	LocalFiles.Prepare ( callback );

EndProcedure

&AtClient
Procedure StartLoadingFile ( Result, Params ) export
	
	callback = new NotifyDescription ( "FileLoaded", ThisObject );
	BeginPutFile ( callback, , Object.Path, false );
	
EndProcedure 

&AtClient
Procedure FileLoaded ( Result, FileAddress, FileName, Params ) export
	
	if ( not Result ) then
		return;
	endif;
	extractFile ( FileAddress );
	Progress.Open ( UUID, ThisObject, new NotifyDescription ( "Loading", ThisObject ), true );

EndProcedure

&AtServer
Procedure extractFile ( val Location )

	p = DataProcessors.LoadInvoices.GetParams ();
	p.File = GetFromTempStorage ( Location );
	ResultAddress = PutToTempStorage ( undefined, UUID );
	p.Address = ResultAddress;
	args = new Array ();
	args.Add ( "LoadInvoices" );
	args.Add ( p );
	Jobs.Run ( "Jobs.ExecProcessor", args, UUID, , TesterCache.Testing () );
	
EndProcedure

&AtClient
Procedure Loading ( Result, Params ) export
	
	if ( Result = undefined ) then
		return;
	endif;
	loadTable ();

EndProcedure

&AtServer
Procedure loadTable ()
	
	table = GetFromTempStorage ( ResultAddress );
	Object.Invoices.Load ( table );
	
EndProcedure

&AtClient
Procedure PathOnChange ( Item )
	
	loadFile ();
	
EndProcedure

&AtClient
Procedure Load ( Command )
	
	if ( setNumbers () ) then
		Notify ( Enum.MessageInvoicesExchnage () );
		Output.DataSuccessfullyLoaded ();
	endif;
	
EndProcedure

&AtServer
Function setNumbers () 

	list = getSelection ();
	if ( list = undefined ) then
		return false;
	else
		BeginTransaction ();
		for each row in list do
			obj = row.Invoice.GetObject ();
			obj.Status = Enums.FormStatuses.Unloaded;
			series = row.Series;
			obj.Series = series;
			obj.FormNumber = row.FormNumber;
			obj.Number = RegulatedRanges.BuildNumber ( , series, row.Number );
			obj.Write ();
		enddo;
		CommitTransaction ();
		return true;
	endif;

EndFunction

&AtServer
Function getSelection () 

	rows = Object.Invoices.Unload ( new Structure ( "Load", true ) );
	if ( rows.Count () = 0 ) then
		Output.EmptyLoadList ( , "Invoices" );
		return undefined;
	else
		return rows;
	endif;
	
EndFunction

// *****************************************
// *********** Table Invoices

&AtClient
Procedure MarkAll ( Command )
	
	mark ( true );
	
EndProcedure

&AtClient
Procedure mark ( Flag ) 

	for each row in Object.Invoices do
		if ( row.Number = "" ) then
			continue;
		endif;
		row.Load = Flag;
	enddo;

EndProcedure

&AtClient
Procedure UnmarkAll ( Command )
	
	mark ( false );
		
EndProcedure

&AtClient
Procedure InvoicesOnActivateRow ( Item )
	
	TableRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure InvoicesSelection ( Item, RowSelected, Field, StandardProcessing )

	StandardProcessing = false;
	ShowValue ( , TableRow.Invoice );

EndProcedure
